Revit 2027 API
BackgroundStyle Enumeration
 Indicates the background style in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BackgroundStyle
Public Enumeration BackgroundStyle
public enum class BackgroundStyle
type BackgroundStyle
Members
Member name | Value | Description
Color | 5 |  Color background.
Image | 6 |  Image background.
SkyCloudy | 3 |  Cloudy sky background.
SkyFewClouds | 2 |  Sky background with few clouds.
SkyNoClouds | 0 |  Sky background without clouds.
SkyVeryCloudy | 4 |  Very cloudy sky background.
SkyVeryFewClouds | 1 |  Sky background with very few clouds.
Transparent | 7 |  Transparent background
See Also
Reference
Autodesk.Revit.DB Namespace